Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
#include <Arduino.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <stdarg.h>
#include <stdio.h>
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

namespace {

constexpr int SERVO_PIN = 18;
constexpr int SENSOR_PIN = 15;
constexpr int SENSOR_HYSTERESIS = 8;
constexpr size_t CLICK_QUEUE_SIZE = 12;
constexpr size_t LOG_QUEUE_SIZE = 16;
constexpr size_t WIDTH_HISTORY_SIZE = 15;
constexpr size_t SPEED_HISTORY_SIZE = 7;
constexpr size_t CLASSIFY_WARMUP = 4;
constexpr size_t ADAPT_WARMUP = 5;
constexpr float DEFAULT_SENSOR_RATIO = 2.0f;
constexpr float ADAPT_SAFETY_BIAS = 1.05f;
constexpr uint32_t CONFIG_MAGIC = 0xD1A02026;
constexpr uint16_t CONFIG_VERSION = 3;

enum class ThemeMode : uint8_t { Auto, Light, Dark };

// Exact layout used by firmware v1/v2 so existing saved calibration survives.
struct LegacyConfig {
  uint32_t magic;
  uint16_t version;
  int threshold;
  int restAngle;
  int pressAngle;
  uint32_t holdMs;
  uint32_t actuatorMs;
  uint32_t travelMs;
  uint32_t minTravelMs;
  uint32_t airMs;
  uint32_t landingMs;
  uint32_t clearanceMs;
  uint32_t gapMs;
  uint32_t cooldownMs;
  uint32_t rearmMs;
  uint32_t themeFlipMs;
  uint32_t sampleMs;
  bool adapt;
  float adaptStepPct;
  ThemeMode theme;
  bool debug;
};

struct Config {
  uint32_t magic = CONFIG_MAGIC;
  uint16_t version = CONFIG_VERSION;
  int threshold = 200;
  int restAngle = 35;
  int pressAngle = 38;

  // Short jump: current working calibration.
  uint32_t holdMs = 80;
  uint32_t airMs = 450;

  // Long jump: hold Space until Chrome Dino reaches its full jump arc.
  uint32_t longHoldMs = 160;
  uint32_t longAirMs = 520;
  float longAtWidths = 1.60f;

  uint32_t actuatorMs = 160;
  uint32_t travelMs = 1550;
  uint32_t minTravelMs = 350;
  uint32_t landingMs = 50;
  uint32_t clearanceMs = 100;
  uint32_t gapMs = 40;
  uint32_t cooldownMs = 70;
  uint32_t rearmMs = 12;
  uint32_t themeFlipMs = 1500;
  uint32_t sampleMs = 5;
  bool adapt = true;
  float adaptStepPct = 3.0f;
  ThemeMode theme = ThemeMode::Auto;
  bool debug = false;
};

struct ClickCommand {
  uint64_t atMs;
  uint32_t generation;
  int pressAngle;
  int restAngle;
  uint32_t holdMs;
  bool manual;
  bool debug;
};

struct Detector {
  bool active = false;
  uint64_t startMs = 0;
  uint64_t lastObstacleMs = 0;
  uint64_t oppositeSinceMs = 0;
  uint64_t lastLandingMs = 0;
  uint64_t lastCommandMs = 0;
  bool hasPlan = false;
  uint32_t travelMs = 0;

  uint32_t widthHistory[WIDTH_HISTORY_SIZE] = {};
  size_t widthCount = 0;
  size_t widthIndex = 0;

  uint32_t speedHistory[SPEED_HISTORY_SIZE] = {};
  size_t speedCount = 0;
  size_t speedIndex = 0;
  uint32_t baselinePulseMs = 0;
  uint32_t plannedJumps = 0;
};

struct LogMessage { char text[160]; };

struct UIntSetting {
  const char *name;
  const char *legacy;
  uint32_t Config::*field;
  uint32_t minValue;
  uint32_t maxValue;
};

constexpr UIntSetting UINT_SETTINGS[] = {
    {"hold", "holdms", &Config::holdMs, 1, 2000},
    {"longhold", "longholdms", &Config::longHoldMs, 1, 2000},
    {"air", "airms", &Config::airMs, 1, 3000},
    {"longair", "longairms", &Config::longAirMs, 1, 3000},
    {"actuator", "actuatorms", &Config::actuatorMs, 0, 5000},
    {"travel", "travelms", &Config::travelMs, 1, 10000},
    {"mintravel", "mintravelms", &Config::minTravelMs, 1, 10000},
    {"landing", "landingms", &Config::landingMs, 0, 2000},
    {"clearance", "clearancems", &Config::clearanceMs, 0, 3000},
    {"gap", "gapms", &Config::gapMs, 1, 1000},
    {"cooldown", "cooldownms", &Config::cooldownMs, 0, 3000},
    {"rearm", "rearmms", &Config::rearmMs, 0, 3000},
    {"sample", "samplems", &Config::sampleMs, 2, 50},
    {"themeflip", "themeflipms", &Config::themeFlipMs, 100, 10000},
};

Servo servo;
Preferences prefs;
Config config;
Detector detector;
float sensorRatio = DEFAULT_SENSOR_RATIO;
QueueHandle_t clickQueue = nullptr;
QueueHandle_t logQueue = nullptr;
SemaphoreHandle_t stateMutex = nullptr;
TaskHandle_t sensorTaskHandle = nullptr;
TaskHandle_t servoTaskHandle = nullptr;
TaskHandle_t serialTaskHandle = nullptr;
volatile bool playing = false;
volatile uint32_t playGeneration = 1;
bool prefsReady = false;
bool backgroundIsWhite = true;
bool filteredWhite = true;
int lastSensorValue = 0;
String serialLine;

uint64_t nowMs() { return static_cast<uint64_t>(esp_timer_get_time()) / 1000ULL; }
const char *onOff(bool v) { return v ? "on" : "off"; }
const char *colorName(bool v) { return v ? "white" : "black"; }
const char *themeName(ThemeMode m) {
  return m == ThemeMode::Light ? "light" : m == ThemeMode::Dark ? "dark" : "auto";
}

Config getConfig() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  Config copy = config;
  xSemaphoreGive(stateMutex);
  return copy;
}

String normalize(String s) {
  s.trim();
  s.toLowerCase();
  s.replace("_", "");
  s.replace("-", "");
  return s;
}

bool parseLong(const String &s, long &out) {
  char *end = nullptr;
  out = strtol(s.c_str(), &end, 10);
  while (end && *end == ' ') ++end;
  return end && end != s.c_str() && *end == '\0';
}

bool parseFloatValue(const String &s, float &out) {
  char *end = nullptr;
  out = strtof(s.c_str(), &end);
  while (end && *end == ' ') ++end;
  return end && end != s.c_str() && *end == '\0';
}

bool parseBool(String s, bool &out) {
  s = normalize(s);
  if (s == "on" || s == "true" || s == "1" || s == "yes") { out = true; return true; }
  if (s == "off" || s == "false" || s == "0" || s == "no") { out = false; return true; }
  return false;
}

void queueLog(const char *format, ...) {
  if (!logQueue) return;
  LogMessage message{};
  va_list args;
  va_start(args, format);
  vsnprintf(message.text, sizeof(message.text), format, args);
  va_end(args);
  xQueueSend(logQueue, &message, 0);
}

// Persistent configuration -------------------------------------------------

bool configValid(const Config &c) {
  return c.magic == CONFIG_MAGIC && c.version == CONFIG_VERSION &&
         c.threshold >= 0 && c.threshold <= 4095 &&
         c.restAngle >= 0 && c.restAngle <= 180 &&
         c.pressAngle >= 0 && c.pressAngle <= 180 &&
         c.holdMs >= 1 && c.holdMs <= 2000 &&
         c.longHoldMs >= 1 && c.longHoldMs <= 2000 &&
         c.airMs >= 1 && c.airMs <= 3000 &&
         c.longAirMs >= 1 && c.longAirMs <= 3000 &&
         c.longAtWidths >= 1.1f && c.longAtWidths <= 4.0f &&
         c.actuatorMs <= 5000 && c.travelMs >= 1 && c.travelMs <= 10000 &&
         c.minTravelMs >= 1 && c.minTravelMs <= 10000 &&
         c.landingMs <= 2000 && c.clearanceMs <= 3000 &&
         c.gapMs >= 1 && c.gapMs <= 1000 && c.cooldownMs <= 3000 &&
         c.rearmMs <= 3000 && c.themeFlipMs >= 100 && c.themeFlipMs <= 10000 &&
         c.sampleMs >= 2 && c.sampleMs <= 50 &&
         c.adaptStepPct > 0 && c.adaptStepPct <= 20 &&
         static_cast<uint8_t>(c.theme) <= 2;
}

