Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
void printStatus() {
  Config cfg = getConfig();
  int adc = readSensor();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  float ratio = sensorRatio;
  uint32_t effective = detector.travelMs;
  bool bg = backgroundIsWhite;
  uint32_t ref = widthReferenceLocked();
  xSemaphoreGive(stateMutex);

  Serial.println("\n=== Dino Auto-Player ===");
  Serial.printf("Run=%s | sensor=%d (%s) | threshold=%d | background=%s | theme=%s\n",
                playing ? "ON" : "OFF", adc, colorName(adc > cfg.threshold),
                cfg.threshold, colorName(bg), themeName(cfg.theme));
  Serial.printf("Servo: rest=%d press=%d | SHORT hold=%lu air=%lu | LONG hold=%lu air=%lu\n",
                cfg.restAngle, cfg.pressAngle,
                static_cast<unsigned long>(cfg.holdMs), static_cast<unsigned long>(cfg.airMs),
                static_cast<unsigned long>(cfg.longHoldMs), static_cast<unsigned long>(cfg.longAirMs));
  Serial.printf("Long jump: width >= %.2f cactus-widths | pulse reference=%lu ms\n",
                cfg.longAtWidths, static_cast<unsigned long>(ref));
  Serial.printf("Timing: actuator=%lu travel=%lu effective=%lu landing=%lu clearance=%lu\n",
                static_cast<unsigned long>(cfg.actuatorMs), static_cast<unsigned long>(cfg.travelMs),
                static_cast<unsigned long>(effective), static_cast<unsigned long>(cfg.landingMs),
                static_cast<unsigned long>(cfg.clearanceMs));
  Serial.printf("Sensor: sample=%lu gap=%lu ratio=%.2f:1 hysteresis=%d\n",
                static_cast<unsigned long>(cfg.sampleMs), static_cast<unsigned long>(cfg.gapMs),
                ratio, SENSOR_HYSTERESIS);
  Serial.printf("Adapt=%s mintravel=%lu step=%.1f%% | debug=%s | flash=%s\n",
                onOff(cfg.adapt), static_cast<unsigned long>(cfg.minTravelMs),
                cfg.adaptStepPct, onOff(cfg.debug), prefsReady ? "ready" : "unavailable");
}

void startAutoplay(bool clickToStart) {
  chooseBackground();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  ++playGeneration;
  resetTimingLocked();
  playing = true;
  bool bg = backgroundIsWhite;
  int adc = lastSensorValue;
  xSemaphoreGive(stateMutex);
  clearClickQueue();

  Serial.printf("[START] Armed. Background=%s sensor=%d.\n", colorName(bg), adc);
  if (clickToStart && queueClick(nowMs(), true, false)) Serial.println("[START] Initial short click queued.");
}

void stopAutoplay() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  playing = false;
  ++playGeneration;
  resetEnvelopeLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);
  clearClickQueue();
  servo.write(rest);
  Serial.println("[STOP] Autoplay stopped.");
}

enum class SetResult { Changed, Invalid, Unknown };

SetResult setParameter(String rawName, String value) {
  String name = normalize(rawName);
  long number = 0;

  if (name == "ratio") {
    float ratio;
    if (!parseFloatValue(value, ratio) || ratio < 0.5f || ratio > 6.0f) return SetResult::Invalid;
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    sensorRatio = ratio;
    xSemaphoreGive(stateMutex);
    if (prefsReady) prefs.putFloat("ratio", ratio);
    Serial.printf("[SET] ratio = %.2f\n", ratio);
    return SetResult::Changed;
  }

  bool changed = false, resetTiming = false, refreshBackground = false, moveRest = false;
  xSemaphoreTake(stateMutex, portMAX_DELAY);

  if (name == "threshold" || name == "rest" || name == "press" || name == "clickangle") {
    if (!parseLong(value, number)) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    if (name == "threshold" && number >= 0 && number <= 4095) config.threshold = number;
    else if (name == "rest" && number >= 0 && number <= 180) config.restAngle = number;
    else if ((name == "press" || name == "clickangle") && number >= 0 && number <= 180)
      config.pressAngle = number;
    else { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    changed = true;
    refreshBackground = name == "threshold";
    moveRest = name == "rest" && !playing;
  } else if (name == "adapt" || name == "debug" || name == "autotheme") {
    bool flag;
    if (!parseBool(value, flag)) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    if (name == "adapt") { config.adapt = flag; resetTiming = true; }
    else if (name == "debug") config.debug = flag;
    else config.theme = flag ? ThemeMode::Auto
                             : (backgroundIsWhite ? ThemeMode::Light : ThemeMode::Dark);
    changed = true;
    refreshBackground = name == "autotheme";
  } else if (name == "adaptstep" || name == "longat") {
    float numberFloat;
    if (!parseFloatValue(value, numberFloat)) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    if (name == "adaptstep") {
      if (numberFloat <= 0 || numberFloat > 20) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
      config.adaptStepPct = numberFloat;
    } else {
      if (numberFloat < 1.1f || numberFloat > 4.0f) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
      config.longAtWidths = numberFloat;
    }
    changed = true;
  } else {
    for (const auto &s : UINT_SETTINGS) {
      if (name != s.name && name != s.legacy) continue;
      if (!parseLong(value, number) || number < 0 ||
          static_cast<uint32_t>(number) < s.minValue ||
          static_cast<uint32_t>(number) > s.maxValue) {
        xSemaphoreGive(stateMutex); return SetResult::Invalid;
      }
      config.*(s.field) = static_cast<uint32_t>(number);
      changed = true;
      resetTiming = name == "travel" || name == "travelms" ||
                    name == "mintravel" || name == "mintravelms";
      break;
    }
  }

  if (resetTiming) resetTimingLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);

  if (!changed) return SetResult::Unknown;
  if (moveRest) servo.write(rest);
  if (refreshBackground) chooseBackground();
  saveConfig();
  Serial.printf("[SET] %s = %s\n", rawName.c_str(), value.c_str());
  return SetResult::Changed;
}

bool setTheme(String value) {
  value = normalize(value);
  ThemeMode mode;
  if (value == "auto") mode = ThemeMode::Auto;
  else if (value == "light") mode = ThemeMode::Light;
  else if (value == "dark") mode = ThemeMode::Dark;
  else return false;

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config.theme = mode;
  resetEnvelopeLocked();
  xSemaphoreGive(stateMutex);
  chooseBackground();
  saveConfig();
  Serial.printf("[THEME] %s.\n", themeName(mode));
  return true;
}

void restoreDefaults() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config = Config{};
  sensorRatio = DEFAULT_SENSOR_RATIO;
  resetTimingLocked();
  bool moveRest = !playing;
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);

  if (moveRest) servo.write(rest);
  chooseBackground();
  saveConfig();
  if (prefsReady) prefs.putFloat("ratio", DEFAULT_SENSOR_RATIO);
  Serial.println("[DEFAULTS] Defaults restored and saved.");
}

void handleCommand(String line) {
  line.trim();
  line.toLowerCase();
  if (!line.length()) return;
  if (line.startsWith("set ")) { line.remove(0, 4); line.trim(); }

